app/Controllers/ClientesController.php

SELECT *
FROM `clientes`
WHERE `cliente_id` = '3'
 LIMIT 1
---
    public function actualizarClientes($id=null)
    {
        $clientes = new ClientesModel();
        $datos['datos'] = $clientes->where('cliente_id',$id)->first();