app/Controllers/Clientes.php

SELECT *
FROM `clientes`
---
    public function index(): string
    {

        $clientes = new ClientesModel();
        $datos = ['titulo' => 'Clientes'];
        $datos['datos'] = $clientes->findAll(); //select * from clientes