app/Controllers/LineasTelefonicas.php

    public function index(): string
    {
        $lineastelefonicas = new LineasTelefonicasModel();
        $datos = ['titulo' => 'Líneas Telefónicas'];
        $datos['datos'] = $lineastelefonicas->findAll(); //select * from clientes
---
SELECT *
FROM `lineas_telefonicas`