app/Controllers/Planes.php

    public function index(): string
    {
        $planes = new PlanesModel();
        $datos = ['titulo' => 'Planes'];
        $datos['datos'] = $planes->findAll(); //select * from clientes
---
SELECT *
FROM `planes`